MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX534F064H.PIC
      <edc:SFRDef edc:_addr="0x1F88B070" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1TMR" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1TMR" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CANTSPRE" edc:desc="" edc:mask="0xffff" edc:name="CANTSPRE" edc:nzwidth="0x10"/>
            <edc:SFRFieldDef edc:cname="CANTS" edc:desc="" edc:mask="0xffff" edc:name="CANTS" edc:nzwidth="0x10"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B080" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B090" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B0A0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B0B0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXM3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1RXM3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="MIDE" edc:desc="" edc:mask="0x1" edc:name="MIDE" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B0C0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON0" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL0" edc:desc="" edc:mask="0x1f" edc:name="FSEL0" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL0" edc:desc="" edc:mask="0x3" edc:name="MSEL0" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN0" edc:desc="" edc:mask="0x1" edc:name="FLTEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL1" edc:desc="" edc:mask="0x1f" edc:name="FSEL1" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL1" edc:desc="" edc:mask="0x3" edc:name="MSEL1" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN1" edc:desc="" edc:mask="0x1" edc:name="FLTEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL2" edc:desc="" edc:mask="0x1f" edc:name="FSEL2" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL2" edc:desc="" edc:mask="0x3" edc:name="MSEL2" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN2" edc:desc="" edc:mask="0x1" edc:name="FLTEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL3" edc:desc="" edc:mask="0x1f" edc:name="FSEL3" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL3" edc:desc="" edc:mask="0x3" edc:name="MSEL3" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN3" edc:desc="" edc:mask="0x1" edc:name="FLTEN3" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B0D0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON1" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON1" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL4" edc:desc="" edc:mask="0x1f" edc:name="FSEL4" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL4" edc:desc="" edc:mask="0x3" edc:name="MSEL4" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN4" edc:desc="" edc:mask="0x1" edc:name="FLTEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL5" edc:desc="" edc:mask="0x1f" edc:name="FSEL5" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL5" edc:desc="" edc:mask="0x3" edc:name="MSEL5" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN5" edc:desc="" edc:mask="0x1" edc:name="FLTEN5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL6" edc:desc="" edc:mask="0x1f" edc:name="FSEL6" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL6" edc:desc="" edc:mask="0x3" edc:name="MSEL6" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN6" edc:desc="" edc:mask="0x1" edc:name="FLTEN6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL7" edc:desc="" edc:mask="0x1f" edc:name="FSEL7" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL7" edc:desc="" edc:mask="0x3" edc:name="MSEL7" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN7" edc:desc="" edc:mask="0x1" edc:name="FLTEN7" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
