MicrochipTech/ethercat-software-framework/ESF/Demo/ESF_EVB_PIC32_LAN925x/firmware/src/packs/PIC32MX_DFP/1.4.241/edc/PIC32MX534F064H.PIC
      <edc:SFRDef edc:_addr="0x1F88B0E0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON2" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON2" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL8" edc:desc="" edc:mask="0x1f" edc:name="FSEL8" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL8" edc:desc="" edc:mask="0x3" edc:name="MSEL8" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN8" edc:desc="" edc:mask="0x1" edc:name="FLTEN8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL9" edc:desc="" edc:mask="0x1f" edc:name="FSEL9" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL9" edc:desc="" edc:mask="0x3" edc:name="MSEL9" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN9" edc:desc="" edc:mask="0x1" edc:name="FLTEN9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL10" edc:desc="" edc:mask="0x1f" edc:name="FSEL10" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL10" edc:desc="" edc:mask="0x3" edc:name="MSEL10" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN10" edc:desc="" edc:mask="0x1" edc:name="FLTEN10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL11" edc:desc="" edc:mask="0x1f" edc:name="FSEL11" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL11" edc:desc="" edc:mask="0x3" edc:name="MSEL11" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN11" edc:desc="" edc:mask="0x1" edc:name="FLTEN11" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B0F0" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON3" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON3" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL12" edc:desc="" edc:mask="0x1f" edc:name="FSEL12" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL12" edc:desc="" edc:mask="0x3" edc:name="MSEL12" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN12" edc:desc="" edc:mask="0x1" edc:name="FLTEN12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL13" edc:desc="" edc:mask="0x1f" edc:name="FSEL13" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL13" edc:desc="" edc:mask="0x3" edc:name="MSEL13" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN13" edc:desc="" edc:mask="0x1" edc:name="FLTEN13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL14" edc:desc="" edc:mask="0x1f" edc:name="FSEL14" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL14" edc:desc="" edc:mask="0x3" edc:name="MSEL14" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN14" edc:desc="" edc:mask="0x1" edc:name="FLTEN14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL15" edc:desc="" edc:mask="0x1f" edc:name="FSEL15" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL15" edc:desc="" edc:mask="0x3" edc:name="MSEL15" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN15" edc:desc="" edc:mask="0x1" edc:name="FLTEN15" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B100" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON4" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON4" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL16" edc:desc="" edc:mask="0x1f" edc:name="FSEL16" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL16" edc:desc="" edc:mask="0x3" edc:name="MSEL16" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN16" edc:desc="" edc:mask="0x1" edc:name="FLTEN16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL17" edc:desc="" edc:mask="0x1f" edc:name="FSEL17" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL17" edc:desc="" edc:mask="0x3" edc:name="MSEL17" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN17" edc:desc="" edc:mask="0x1" edc:name="FLTEN17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL18" edc:desc="" edc:mask="0x1f" edc:name="FSEL18" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL18" edc:desc="" edc:mask="0x3" edc:name="MSEL18" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN18" edc:desc="" edc:mask="0x1" edc:name="FLTEN18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL19" edc:desc="" edc:mask="0x1f" edc:name="FSEL19" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL19" edc:desc="" edc:mask="0x3" edc:name="MSEL19" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN19" edc:desc="" edc:mask="0x1" edc:name="FLTEN19" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B110" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON5" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON5" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL20" edc:desc="" edc:mask="0x1f" edc:name="FSEL20" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL20" edc:desc="" edc:mask="0x3" edc:name="MSEL20" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN20" edc:desc="" edc:mask="0x1" edc:name="FLTEN20" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL21" edc:desc="" edc:mask="0x1f" edc:name="FSEL21" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL21" edc:desc="" edc:mask="0x3" edc:name="MSEL21" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN21" edc:desc="" edc:mask="0x1" edc:name="FLTEN21" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL22" edc:desc="" edc:mask="0x1f" edc:name="FSEL22" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL22" edc:desc="" edc:mask="0x3" edc:name="MSEL22" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN22" edc:desc="" edc:mask="0x1" edc:name="FLTEN22" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL23" edc:desc="" edc:mask="0x1f" edc:name="FSEL23" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL23" edc:desc="" edc:mask="0x3" edc:name="MSEL23" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN23" edc:desc="" edc:mask="0x1" edc:name="FLTEN23" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B120" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON6" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON6" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL24" edc:desc="" edc:mask="0x1f" edc:name="FSEL24" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL24" edc:desc="" edc:mask="0x3" edc:name="MSEL24" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN24" edc:desc="" edc:mask="0x1" edc:name="FLTEN24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL25" edc:desc="" edc:mask="0x1f" edc:name="FSEL25" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL25" edc:desc="" edc:mask="0x3" edc:name="MSEL25" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN25" edc:desc="" edc:mask="0x1" edc:name="FLTEN25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL26" edc:desc="" edc:mask="0x1f" edc:name="FSEL26" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL26" edc:desc="" edc:mask="0x3" edc:name="MSEL26" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN26" edc:desc="" edc:mask="0x1" edc:name="FLTEN26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL27" edc:desc="" edc:mask="0x1f" edc:name="FSEL27" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL27" edc:desc="" edc:mask="0x3" edc:name="MSEL27" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN27" edc:desc="" edc:mask="0x1" edc:name="FLTEN27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B130" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="C1FLTCON7" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="C1FLTCON7" edc:nzwidth="0x20" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="FSEL28" edc:desc="" edc:mask="0x1f" edc:name="FSEL28" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL28" edc:desc="" edc:mask="0x3" edc:name="MSEL28" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN28" edc:desc="" edc:mask="0x1" edc:name="FLTEN28" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL29" edc:desc="" edc:mask="0x1f" edc:name="FSEL29" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL29" edc:desc="" edc:mask="0x3" edc:name="MSEL29" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN29" edc:desc="" edc:mask="0x1" edc:name="FLTEN29" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL30" edc:desc="" edc:mask="0x1f" edc:name="FSEL30" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL30" edc:desc="" edc:mask="0x3" edc:name="MSEL30" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN30" edc:desc="" edc:mask="0x1" edc:name="FLTEN30" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FSEL31" edc:desc="" edc:mask="0x1f" edc:name="FSEL31" edc:nzwidth="0x5"/>
            <edc:SFRFieldDef edc:cname="MSEL31" edc:desc="" edc:mask="0x3" edc:name="MSEL31" edc:nzwidth="0x2"/>
            <edc:SFRFieldDef edc:cname="FLTEN31" edc:desc="" edc:mask="0x1" edc:name="FLTEN31" edc:nzwidth="0x1"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F88B140" edc:_begin="0x0" edc:_end="0xb50" edc:_modsrc="DOS-01152_can_bvci_v1.Module" edc:_refcount="1" edc:access="nnnnnnnnnnn-n-nnnnnnnnnnnnnnnnnn" edc:cname="C1RXF0" edc:desc="" edc:grp="CAN1" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuuuuu0u0uuuuuuuuuuuuuuuuuu" edc:name="C1RXF0" edc:nzwidth="0x20" edc:por="xxxxxxxxxxx0x0xxxxxxxxxxxxxxxxxx" edc:portals="CLR SET INV" ltx:memberofperipheral="CAN1">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EID" edc:desc="" edc:mask="0x3ffff" edc:name="EID" edc:nzwidth="0x12"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="SID" edc:desc="" edc:mask="0x7ff" edc:name="SID" edc:nzwidth="0xb"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0x1" edc:name="w" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
